Revit 2026 API

# ViewGetWorksharingDisplayMode Method

---

Gets the current worksharing display mode for this view.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public WorksharingDisplayMode GetWorksharingDisplayMode()
```
```vb
Public Function GetWorksharingDisplayMode As WorksharingDisplayMode
```
```cpp
public:
WorksharingDisplayMode GetWorksharingDisplayMode()
```
```fsharp
member GetWorksharingDisplayMode : unit -> WorksharingDisplayMode
```

#### Return Value

WorksharingDisplayMode The active worksharing display mode in this view.

Returns "Off" if no worksharing display mode is currently enabled.

#### Reference

View Class

Autodesk.Revit.DB Namespace